
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |           7 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                               |
|:--------:|:--------------------------------------------------------------------------------------------------------|
|    🟡    | `github_organization_settings.infrahouse`                                                               |
|    🟡    | `module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github`                              |
|    🟡    | `module.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin`                                 |
|    🟡    | `module.infrahouse8-github-control.module.gha-admin.aws_iam_role.github`                                |
|    🟡    | `module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro` |
|    🟡    | `module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw` |
|    🟡    | `module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager`    |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # github_organization_settings.infrahouse will be updated in-place
  ~ resource "github_organization_settings" "infrahouse" {
      ~ description                                                  = "MySQL on AWS." -> "Simplifying Cloud Complexity"
        id                                                           = "121984263"
        name                                                         = "InfraHouse"
        # (24 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin-trust" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::303467602807:role/ih-tf-github-control-github",
                  + "arn:aws:iam::990466748045:user/aleks",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "github-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + resources = [
              + "arn:aws:iam::289256138624:role/ih-tf-github-control-state-manager",
              + "arn:aws:iam::289256138624:role/ih-tf-terraform-control",
              + "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",
            ]
        }
    }

  # module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github will be updated in-place
  ~ resource "aws_iam_policy" "github" {
        id               = "arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001"
        name             = "ih-tf-github-control-github20231016152934873800000001"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",
                          - "arn:aws:iam::289256138624:role/ih-tf-terraform-control",
                          - "arn:aws:iam::289256138624:role/ih-tf-github-control-state-manager",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/gha-admin/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin will be updated in-place
  ~ resource "aws_iam_role" "admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::990466748045:user/aleks",
                              - "arn:aws:iam::303467602807:role/ih-tf-github-control-github",
                            ]
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ih-tf-github-control-admin"
      ~ max_session_duration  = 3600 -> 43200
        name                  = "ih-tf-github-control-admin"
        tags                  = {
            "created_by_module" = "infrahouse/gha-admin/aws"
        }
        # (10 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.aws_iam_role.github will be updated in-place
  ~ resource "aws_iam_role" "github" {
        id                    = "ih-tf-github-control-github"
      ~ max_session_duration  = 3600 -> 43200
        name                  = "ih-tf-github-control-github"
        tags                  = {
            "created_by_module" = "infrahouse/gha-admin/aws"
        }
        # (11 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro will be updated in-place
  ~ resource "aws_iam_policy" "permissions_ro" {
        id               = "arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001"
        name             = "ih-tf-github-control-state-manager-ro20231016152936860000000001"
      ~ tags             = {
          + "created_by_module" = "infrahouse/state-manager/aws"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/state-manager/aws"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw will be updated in-place
  ~ resource "aws_iam_policy" "permissions_rw" {
        id               = "arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002"
        name             = "ih-tf-github-control-state-manager-rw20231016152936864600000002"
      ~ tags             = {
          + "created_by_module" = "infrahouse/state-manager/aws"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/state-manager/aws"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-github-control-state-manager"
      ~ max_session_duration  = 3600 -> 43200
        name                  = "ih-tf-github-control-state-manager"
      ~ tags                  = {
          + "created_by_module" = "infrahouse/state-manager/aws"
        }
      ~ tags_all              = {
          + "created_by_module" = "infrahouse/state-manager/aws"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMCwgImNoYW5nZSI6IDcsICJkZXN0cm95IjogMH19
```
</details>